---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudOverrides.Assign(Autodesk.Revit.DB.PointClouds.PointCloudOverrides)
zh: 赋值、设置值、写入
source: html/fc5f1a12-b260-8ee2-1f5c-f06bf068d19c.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrides.Assign Method

**中文**: 赋值、设置值、写入

Assigns values of the source overrides to this object.

## Syntax (C#)
```csharp
public void Assign(
	PointCloudOverrides other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.PointClouds.PointCloudOverrides`) - The source overrides.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null